{"config": [{"config": {"name": "masking_1", "trainable": true, "batch_input_shape": [null, 5, 49], "dtype": "float32", "mask_value": -1}, "class_name": "Masking"}, {"config": {"recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_regularizer": null, "stateful": false, "name": "lstm_1", "activation": "tanh", "return_state": false, "bias_constraint": null, "return_sequences": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 32, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "kernel_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.2, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 32], "name": "dense_1", "use_bias": true, "units": 21, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "activation": "linear", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential"}